[
    {"book": "Bukhari", "hadith": "Actions are judged by intentions."},
    {"book": "Muslim", "hadith": "The best among you are those who have the best manners."},
    {"book": "Tirmidhi", "hadith": "Allah does not look at your appearance or wealth, but at your hearts and actions."},
    {"book": "Bukhari", "hadith": "None of you truly believes until he loves for his brother what he loves for himself."},
    {"book": "Muslim", "hadith": "Whoever believes in Allah and the Last Day should speak good or remain silent."},
    {"book": "Tirmidhi", "hadith": "A good word is charity."},
    {"book": "Bukhari", "hadith": "The strong man is not the one who overcomes others by strength, but the one who controls himself when angry."},
    {"book": "Muslim", "hadith": "The one who guides to something good is like the one who does it."},
    {"book": "Tirmidhi", "hadith": "Do not waste water, even if you perform ablution on the banks of a flowing river."},
    {"book": "Bukhari", "hadith": "The one who is not grateful to people is not grateful to Allah."},
    {"book": "Muslim", "hadith": "Modesty is part of faith."},
    {"book": "Tirmidhi", "hadith": "The best charity is that given when one is in need and struggling."},
    {"book": "Bukhari", "hadith": "Smiling at your brother is an act of charity."},
    {"book": "Muslim", "hadith": "A true Muslim is the one from whose tongue and hands others are safe."},
    {"book": "Tirmidhi", "hadith": "The believer is not one who eats while his neighbor is hungry."},
    {"book": "Bukhari", "hadith": "The most beloved of deeds to Allah are those done consistently, even if they are small."},
    {"book": "Muslim", "hadith": "Paradise lies under the feet of mothers."},
    {"book": "Tirmidhi", "hadith": "Do not be angry, and you will enter Paradise."},
    {"book": "Bukhari", "hadith": "Whoever removes a hardship for a believer in this world, Allah will remove a hardship from him in the Hereafter."},
    {"book": "Muslim", "hadith": "Whoever builds a mosque for Allah, Allah will build for him a house in Paradise."},
    {"book": "Tirmidhi", "hadith": "He who does not show mercy to others will not receive mercy."},
    {"book": "Bukhari", "hadith": "The best of you are those who learn the Quran and teach it."},
    {"book": "Muslim", "hadith": "Whoever follows a path seeking knowledge, Allah will make his path to Paradise easy."},
    {"book": "Tirmidhi", "hadith": "A kind word and forgiving faults are better than charity followed by hurtful words."},
    {"book": "Bukhari", "hadith": "Every act of kindness is charity."},
    {"book": "Muslim", "hadith": "The Prophet (ﷺ) was more shy than a young girl in her private room."},
    {"book": "Tirmidhi", "hadith": "He who does not thank people has not thanked Allah."},
    {"book": "Bukhari", "hadith": "Whoever fasts Ramadan with faith and seeking reward, his past sins will be forgiven."},
    {"book": "Muslim", "hadith": "The one who maintains ties of kinship will have their sustenance and lifespan increased."},
    {"book": "Tirmidhi", "hadith": "Do not envy one another; do not inflate prices; do not hate one another; and do not turn away from one another."},
    {"book": "Bukhari", "hadith": "The most beloved deeds to Allah are offering prayers on time."},
    {"book": "Muslim", "hadith": "Your smile for your brother is charity."},
    {"book": "Tirmidhi", "hadith": "A believer is like a date palm tree, whatever it takes from it is beneficial."},
    {"book": "Bukhari", "hadith": "Do not curse time, for Allah is time."},
    {"book": "Muslim", "hadith": "When one of you makes dua, let him not say, ‘O Allah, forgive me if You will.’ Rather, let him be firm in asking."},
    {"book": "Tirmidhi", "hadith": "The best of companions in the sight of Allah is the one who is best to his companion."},
    {"book": "Bukhari", "hadith": "Allah helps His servant as long as the servant is helping his brother."},
    {"book": "Muslim", "hadith": "A person will be with those whom he loves."},
    {"book": "Tirmidhi", "hadith": "The most beloved people to Allah are those who are most beneficial to people."},
    {"book": "Bukhari", "hadith": "The best of people are those who bring the most benefit to others."},
    {"book": "Muslim", "hadith": "The Prophet (ﷺ) said: 'The strong believer is better and more beloved to Allah than the weak believer, but there is goodness in both.'"},
    {"book": "Tirmidhi", "hadith": "When a person dies, his deeds end except for three: ongoing charity, beneficial knowledge, or a righteous child who prays for him."},
    {"book": "Bukhari", "hadith": "The Prophet (ﷺ) said: 'A Muslim is the brother of a Muslim. He does not oppress him, nor does he abandon him.'"},
    {"book": "Muslim", "hadith": "The Prophet (ﷺ) said: 'A good dream is from Allah, and a bad dream is from Shaytan.'"},
    {"book": "Tirmidhi", "hadith": "The Prophet (ﷺ) said: 'Whoever prays Fajr is under the protection of Allah.'"},
    {"book": "Bukhari", "hadith": "The Prophet (ﷺ) said: 'The best supplication is Alhamdulillah.'"},
    {"book": "Muslim", "hadith": "The Prophet (ﷺ) said: 'The best of you are those who feed others and return the greeting of Salam.'"},
    {"book": "Tirmidhi", "hadith": "The Prophet (ﷺ) said: 'Fear Allah wherever you are, follow up a bad deed with a good one, and behave well towards people.'"}
  ]
  